Repository: Orange-OpenSource/m-dan
Catalog: iOS/DAN/*.lproj/Localizable.strings
Languages: fr

# example_standardComponents_standardVsCustom_shortDescription
source: Standard versus custom components
fr: Différence avec les composants personnalisés

# example_standardComponents_tab_description
source: The following examples describe the difference between a standard component and a custom one, in this case: tabs. However, a custom component can be accessible: we see that on the second example. Standard components have already a correct vocalization. When using custom components, we have to make adjustements so they are accessible et correctly vocalized using the corresponding options.
fr: Les exemples ci-dessous vous montre la différence entre la vocalisation d'un composant standard, en l'occurence les onglets, et un composant personnalisé. Il est cependant possible de rendre accessible un composant personnalisé ; c'est d'ailleurs ce que montre le second exemple accessible. Les composants standards apportent une vocalisation correct par défaut. L'utilisation de composants personnalisés nécessitent souvent de les rendre accessible en corrigeant, via les options adaptées, les défauts de vocalisation.

# criteria_category_clickZone_whatFor
source: If a touch target of a component is too small, it can prevent some users to enjoy the application. This can lead to frustration that can result uninstalling it.
fr: Une taille insuffisante pour la zone d'action d'un composant peut empêcher certains utilisateurs de profiter pleinement de l'application. Cela peut engendrer des frustrations qui peuvent conduire à la désinstallation de l'application.

# criteria_category_clickZone_howTo
source: Each clickable element must have a touch target large enough. 44 pt is the recommended touch target size for on-screen elements according to Apple (height and width)
fr: Chaque élément cliquable d'une application doit donner à l'utilisateur une taille suffisante pour sa zone d'action. Apple définit pour son système une taille de zone de clic minimum de 44pt.

# example_clickZone_size_title
source: Touch target
fr: Taille de la zone de clic

# example_clickZone_size_shortDescription
source: What is the minimum size?
fr: Quelle est la taille minimale ?

# example_clickZone_size_description
source: In the following non accessible example, the "play" button does not have a large enough touch target, thus it is not easy to click on it.
fr: Dans l'exemple non accessible ci-dessous, le bouton "play" ne possède pas une taille suffisante et par conséquent il n'est pas aisé de cliquer dessus.

# example_clickZone_size_play_song
source: Play song
fr: Lancer la chanson

# example_clickZone_size_play_alertTitle
source: Play button pressed!
fr: Appuie sur le bouton de lecture détecté !

# criteria_category_elementState_whatFor
source: If an element does not vocalize its status, nature or state, the TalkBack user is unable to understand what is happening on the screen. Not specifying that a view is unfolded or that we have tabs are very common examples.
fr: Si un élément ne restitue pas à la vocalisation son statut, sa nature ou son état, l'utilisateur de VoiceOver est dans l'impossibilité de comprendre ce qu'il se passe à l'écran. Ne pas préciser qu'une zone est dépliée ou que l'on se trouve face à un système d'onglets (non standard) sont des exemples très fréquents.

# criteria_category_elementState_howTo
source: Any item whose status changes when using the application must vocalize its status through its text alternative. For example, an item that can be selected/unselected must vocalize its state through a text alternative.
fr: Tout élément dont le statut est modifié durant l'utilisation de l'application doit restituer son état à travers son alternative textuelle. Par exemple, un élément qui peut être sélectionné/non sélectionné doit restituer son état à travers une alternative textuelle.

# example_elementState_tab_title
source: Tabs
fr: Onglets

# example_elementState_tab_shortDescription
source: Vocalize tabs status
fr: Présenter l’état des onglets

# example_elementState_tab_description
source: Common mistake on iOS: tabs. By default, tabs in iOS are accessible. Meanwhile, it is very common to customize the tabs look and feel. So it is the developer's responsibility to provide the tab state and nature to the user via the corresponding accessibility attributes. Note that is possible to make them accessible, an example is available in the "standards components" section.
fr: Grand classique de ce problème : les onglets. Par défaut, les onglets proposés dans iOS sont parfaitement accessible. Cependant, il est fréquent de proposer des onglets personnalisés afin d’avoir un rendu différent. Il est donc à la charge du développeur de donner les informations de nature et d’états des onglets à l'utilisateur via les attributs d'accessibilité correspondants. Notons toutefois qu'il serait possible de rendre accessible ces onglets personnalisés comme cela est montré avec l'exemple de la section "composants standards".

# example_elementState_selectionList_title
source: Selectable List
fr: Liste avec selection

# example_elementState_selectionList_shortDescription
source: Selectable List
fr: Liste avec selection

# example_elementState_selectionList_description
source: If a list item can be selected, its text alternative should reflect its state. In the case of a list item, one should redefine the text alternative for each item.
fr: Si un item d'une liste peut être sélectionné, il faut que son alternative textuelle reflète son état. Dans le cas d'un item de liste, il suffit de redéfinir l'alternative du texte de l'item.

# example_elementState_selectionList_cell_man
source: Man
fr: Homme

# example_elementState_selectionList_cell_woman
source: Woman
fr: Femme

# example_elementState_selectionList_cell_clickToSelect
source: Click to select
fr: Cliquer pour selectionner

# example_elementState_foldArea_title
source: Expandable / Collapsable views
fr: Zones dépliables

# example_elementState_foldArea_shortDescription
source: Display the focus of the areas
fr: Présenter l’état des zones dépliables et accordéons

# example_elementState_foldArea_description
source: Another common mistake is when elements do not vocalize their state: the Expandable / Collapsable views. Again, thanks to the text alternative title of the view, we can vocalize the state of the view to the VoiceOver users.
fr: Autre classique d'élement qui ne restitue pas par défaut son état : les zones dépliables. Encore une fois, c'est grâce à l'alternative textuelle du titre de la zone dépliable que l'on peut donner à l'utilisateur de VoiceOver le statut de celle-ci.

# criteria_category_ghostElement_whatFor
source: Although invisible to the screen, some elements can be vocalized by the screen reader (elements positioned outside the visible area or hidden by other elements). The superposition of screens is something current when designing mobile apps but it generates very heavy accessibility problems if it is not done properly from the start. A screen reader such as VoiceOver is able to read information from a view that is placed "under" another. But if the user is able to interact with this view, it disturbs totally navigation and it quickly becomes impossible.
fr: Bien qu'invisibles à l'écran, certains éléments peuvent être lus par le lecteur d'écran (éléments positionnés en dehors de la zone visible ou masqués par d'autres éléments). La superposition d'écrans est quelque chose de courant sur mobile mais cela engendre des problèmes d'accessibilité très lourds à corriger si elle n'est pas faite correctement dès le départ. Un lecteur d'écran tel que VoiceOver est capable de lire les informations d'une vue qui est placée "sous" une autre. Mais si l'utilisateur n'est plus capable d'interagir avec cette vue, cela perturbe totalement sa navigation et celle-ci devient vite impossible.

# criteria_category_ghostElement_howTo
source: With the screen reader, there is no invisible reachable element or that should not take focus when reading a page.
fr: Masquer au lecteur d'écran tout élément non visible et tout élément qui ne doit pas prendre le focus lors de la lecture d'une page.

# example_ghostElement_alert_title
source: Alert
fr: Alerte

# example_ghostElement_alert_shortDescription
source: Alert with ghost elements
fr: Alerte avec éléments fantômes

# example_ghostElement_alert_description
source: In this example the custom alert dialog has a ghost element. So, when VoiceOver is activated, we still could navigate through the elements behind the dialog. Note that it is possible to make it accessible as you can see in the "standard components" section
fr: Dans l’exemple ci-dessous, l’alerte personnalisée présente ce problème de vue fantôme. En effet, avec VoiceOver d’activé, vous serez toujours en mesure de parcourir les éléments situés en-dessous. Notons toutefois qu'il serait possible de rendre accessible l'alerte personnalisée comme cela est expliqué avec l'exemple des onglets dans la section "composants standards".

# example_ghostElement_alert_buttonText
source: Alert!
fr: Alerte !

# example_ghostElement_alert_accessibleAlerteTitle
source: This is a standard alert!
fr: Ceci est une alerte standard !

# example_ghostElement_alert_nonAccessibleAlerteTitle
source: This is a custom alert!
fr: Ceci est une alerte personnalisée !

# criteria_category_contentControl_whatFor
source: On mobile, screen readers try to notify the user when there is a context change. In some cases, it can give constant vocalizations, and therefore inaudible, or prevent any user action.
fr: Sur mobile, les lecteurs d'écran essayent de transmettre au maximum à l'utilisateur les changements de contexte, ce qui peut donner des vocalisations permanentes, et donc inaudibles, ou empêcher toute action de l'utilisateur.

# criteria_category_contentControl_howTo
source: The user must control the content at any time. This is especially true with interactive content. So avoid video player launching directly in full screen mode, or videos starting automatically without user action, or a carousel scrolling automatically etc.
fr: L'utilisateur doit rester maître du contenu à tout instant. C'est particulièrement vrai avec le contenu interactif. Il faut donc éviter par exemple qu'une vidéo ne se lance directement en plein écran, qu'une vidéo ne se lance directement sans une action au préalable de l'utilisateur, qu'un carrousel défile de manière automatique etc.

# example_contentControl_carousel_title
source: Carousel scrolling automatically
fr: Carousel automatique

# example_contentControl_carousel_shortDescription
source: Avoid automatic scroll
fr: Eviter le défilement automatique

# example_contentControl_carousel_description
source: Here, the carousel is not accessible because it scrolls automatically and does not provide information on the images. Furthermore, depending on the implementation, it can vocalize each time the image is changed and can prevent the normal vocalization of the whole page.
fr: Ici, le carrousel non accessible défile de façon automatique et ne permet pas d’obtenir les informations des images. De plus, suivant l'implémentation de ce dernier, cela peut même aller jusqu'à une vocalisation systématique des changements qui peut engendrer un blocage auditif pour le reste de la page.

# example_contentControl_carousel_buttonText
source: Show carousel
fr: Afficher le carousel

# example_contentControl_carousel_accessibleCarousel
source: Accessible carousel
fr: Carousel accessible

# example_contentControl_carousel_nonAccessibleCarousel
source: Non accessible carousel
fr: Carousel non accessible

# example_contentControl_carousel_imageLabel1
source: Order before the 21th of December and get your gifts before Christmas!
fr: Commandez avant le 21 décembre midi et recevez vos cadeaux avant Noël !

# example_contentControl_carousel_imageLabel2
source: Deal - Sony Xperia Z3 for 1 euro instead of 69,99€ with the Origami Play 4Go plan, shipped before Christmas if ordered at Orange.fr before the 21th of December 2015 midi, deal valid from the 14th to the 20th of December 2015 included
fr: Bon plan - Sony Xperia Z3 à 1 euro au lieu de 69,99 avec un forfait Origami Play 4Go, livré avant Noël si commandé sur Orange.fr avant le 21 décembre 2015 midi, offre valable du 14 au 20 décembre 2015 inclus

# example_contentControl_carousel_imageLabel3
source: Deal - one free month on the Origami Play 4Go plan for any new subscription to Origami Play 4Go plan with 24-month engagement with the promo code PLAY4, deal valid from the 14th to the 20th of December 2015 included
fr: Bon plan - un mois offert sur Origami Play 4Go pour toute nouvelle souscription à un forfait Origami Play 4Go avec engagement 24 mois avec le code promo PLAY4, offre valable du 14 au 20 décembre 2015 inclus

# example_contentControl_carousel_nonAccessibleImageLabel1
source: Carousel image 1
fr: Image carousel 1

# example_contentControl_carousel_nonAccessibleImageLabel2
source: Carousel image 2
fr: Image carousel 2

# example_contentControl_carousel_nonAccessibleImageLabel3
source: Carousel image 3
fr: Image carousel 3

# example_contentControl_carousel_buttonLabelAccessible
source: Show accessible carousel
fr: Afficher le carousel accessible

# example_contentControl_carousel_buttonLabelNonAccessible
source: Show non accessible carousel
fr: Afficher le carousel non accessible

# example_contentControl_slideshow_title
source: Images slideshow
fr: Diaporama d'images

# example_contentControl_slideshow_shortDescription
source: Accessible slideshow, it's possible!
fr: Diaporama accessible, c'est possible !

# example_contentControl_slideshow_description
source: In this example, we display an image clicking on the button. A common mistake is to automatically open the image in fullscreen. This will block the VoiceOver user if there is no button to close the fullscreen mode.
fr: Dans cet exemple, on affiche simplement une image en cliquant sur le bouton. Une erreur commune est de vouloir passer l'image en plein écran à l'ouverture de la page. Cela a pour effet de bloquer l'utilisateur de VoiceOver si aucune action n'a été prévue pour repasser en mode simple.

# example_contentControl_slideshow_buttonText
source: Show slideshow
fr: Afficher le diaporama

# example_contentControl_slideshow_accessibleSlideshow
source: Accessible slideshow
fr: Diaporama accessible

# example_contentControl_slideshow_nonAccessibleSlideshow
source: Non accessible slideshow
fr: Diaporama non accessible

# example_contentControl_slideshow_playButtonLabel
source: Play slideshow
fr: Lancer le diaporama

# example_contentControl_slideshow_closeButtonLabel
source: Close
fr: Fermer

# example_contentControl_slideshow_previousButtonLabel
source: Previous
fr: Précédent

# example_contentControl_slideshow_nextButtonLabel
source: Next
fr: Suivant

# example_contentControl_slideshow_buttonLabelAccessible
source: Show accessible slideshow
fr: Afficher le diaporama accessible

# example_contentControl_slideshow_buttonLabelNonAccessible
source: Show non accessible slideshow
fr: Afficher le diaporama non accessible

# criteria_category_contentChange_whatFor
source: When content is dynamically modified after a user action, the screen reader must notify it. Without any voice feedback, the user does not know that the content has changed.
fr: Lorsque du contenu est modifié dynamiquement à la suite d'une action de l'utilisateur, il faut le notifier à la synthèse vocale. Sans retour vocal, l'utilisateur ne sait pas qu'une action a été déclenchée.

# criteria_category_contentChange_howTo
source: If the content has changed dynamically after a user action, it is important that the screen reader is notified so that it triggers a vocalization. E.g. refreshing a list or a timer.
fr: Sur une page, si du contenu est modifié dynamiquement suite à une action utilisateur, il est important que le lecteur d'écran soit notifié afin qu'il déclenche une vocalisation. Par exemple, les listes qui se rafraîchissent, ou un compteur de temps.

# example_contentChange_elementUpdate_title
source: Element update
fr: Mise à jour d'un élement

# example_contentChange_elementUpdate_shortDescription
source: Vocalize element updates in a page
fr: Vocaliser les mises à jour d'éléments dans la page

# example_contentChange_elementUpdate_description
source: In this example, a form option allows to display a new field. In the non accessible example, no vocalization of the new content is triggered. On the contrary, in the accessible example, the focus is set on the new field so it is volcalized and the user is notified that a change has been made.
fr: Dans cette exemple, une option de formulaire permet de faire apparaitre un nouveau champ.. Dans le cas de l'exemple non accessible, aucune vocalisation n'est enclenché à l’affichage. A contrario, dans l’exemple accessible, le focus est positionné sur le nouveau champ ce qui permet directement à l’utilisateur de comprendre qu’un changement a eu lieu.

# example_contentChange_elementUpdate_switchTitle
source: Billing address is the same as delivering address
fr: Adresse de facturation identique à l'adresse de livraison

# example_contentChange_elementUpdate_placeholder
source: Billing address
fr: Adresse de facturation

# example_contentChange_elementUpdate_deliveryAddress
source: Delivery address
fr: Adresse de livraison

# example_contentChange_elementUpdate_billingAddress
source: Billing address
fr: Adresse de facturation

# criteria_category_horizontalScroll_whatFor
source: Poor management of constraints when designing the screen can cause problems when you want to use the application in landscape mode.
fr: Un scroll horizontal peut être très difficile à détecter si aucun visuel n'aide l'utilisateur à comprendre qu'il existe plusieurs pages.

# criteria_category_horizontalScroll_howTo
source: Do not hesitate to display a view to indicate a horizontal scroll ("dots" for example). When necessary, also add "next" and "previous" buttons.
fr: Ne pas hésiter à afficher un élément pour indiquer un scroll horizontal (des "points" par exemple). Quand cela est nécessaire, ajouter également des boutons "suivant" et "précédent".

# example_horizontalScroll_carousel_title
source: Horizontal scroll
fr: Scroll horizontal

# example_horizontalScroll_carousel_shortDescription
source: Show that we can scroll horizontally
fr: Indiquer que l'on peut scroller horizontalement

# example_horizontalScroll_carousel_description
source: Here, the carousel is accessible because it has dots that reflect it has several pages. On the contrary, in the non accessible example, one can think there is only one page.
fr: Le carrousel accessible ci-dessous fait bien comprendre grâce aux "points" qu'il possède plusieurs pages. A contrario, le carrousel non accessible ne permet pas de comprendre en un coup d'œil cela et on peut facilement croire que c'est une seule et unique information.

# example_horizontalScroll_carousel_buttonText
source: Show carousel
fr: Afficher le carousel

# example_horizontalScroll_carousel_accessibleCarousel
source: Accessible carousel
fr: Carousel accessible

# example_horizontalScroll_carousel_nonAccessibleCarousel
source: No accessible carousel
fr: Carousel non accessible

# example_horizontalScroll_carousel_imageLabel1
source: Order before the 21th of December and get your gifts before Christmas!
fr: Commandez avant le 21 décembre midi et recevez vos cadeaux avant Noël !

# example_horizontalScroll_carousel_imageLabel2
source: Deal - Sony Xperia Z3 for 1 euro instead of 69,99€ with the Origami Play 4Go plan, shipped before Christmas if ordered at Orange.fr before the 21th of December 2015 midi, deal valid from the 14th to the 20th of December 2015 included
fr: Bon plan - Sony Xperia Z3 à 1 euro au lieu de 69,99 avec un forfait Origami Play 4Go, livré avant Noël si commandé sur Orange.fr avant le 21 décembre 2015 midi, offre valable du 14 au 20 décembre 2015 inclus

# example_horizontalScroll_carousel_imageLabel3
source: Deal - one free month on the Origami Play 4Go plan for any new subscription to Origami Play 4Go plan with 24-month engagement with the promo code PLAY4, deal valid from the 14th to the 20th of December 2015 included
fr: Bon plan - un mois offert sur Origami Play 4Go pour toute nouvelle souscription à un forfait Origami Play 4Go avec engagement 24 mois avec le code promo PLAY4, offre valable du 14 au 20 décembre 2015 inclus

# example_horizontalScroll_carousel_buttonLabelAccessible
source: Show accessible carousel
fr: Afficher le carousel accessible

# example_horizontalScroll_carousel_buttonLabelNonAccessible
source: Show non accessible carousel
fr: Afficher le carousel non accessible

# criteria_category_orientation_whatFor
source: A horizontal scroll can be very difficult to detect if no visual feedback is displayed to help the user understand that there are several pages.
fr: Une mauvaise gestion des contraintes lors de la conception de l'écran peut provoquer des problèmes lorsque l'on souhaite utiliser l'application en mode paysage.

# criteria_category_orientation_howTo
source: Do not hesitate to use constraints or UIStackView so that the elements fit correctly. N nFor a perfect optimization it is possible to use size classes when necessary
fr: Ne pas hésiter à utiliser les contraintes ou les UIStackView pour que les élements s'adaptent correctement. Pour une optimisation parfaite il est possible d'utiliser les sizes classes quand cela est nécessaire.

# example_orientation_title
source: Orientation device
fr: Orientation

# example_orientation_shortDescription
source: Show that we can perform horizontal orientation
fr: Indiquer que l'on peut utilisé l'application en mode paysage

# example_orientation_description
source: Here, the button is accessible because the graphic elements are well managed with the constraints. On the contrary, in the non accessible example, we can think that the button has no constraints.
fr: Le bouton accessible ci-dessous est correctement géré par les "contraintes" nous avons aucunes pertes d'informations. A contrario, le bouton non accessible ne permet pas d'être lu facilement lorsque l'on oriente le téléphone en mode paysage ; la navigation sera désagréable pour l'utilisateur.

# criteria_category_form_whatFor
source: Binding the form fields with their labels provides an additional vocalization allowing the user to understand what happens when filling out a form field.
fr: Lier les champs de formulaires avec leurs labels apporte une vocalisation supplémentaire qui permet à l'utilisateur de comprendre ce qu'il doit remplir lorsqu'il arrive sur un champ de formulaire.

# criteria_category_form_howTo
source: Each form field should be linked to a relevant label
fr: Chaque champ de formulaire doit être lié à un label.

# example_form_label_title
source: Forms
fr: Formulaires

# example_form_label_description
source: In the following example, some fields have a label, some do not. Thus, you can hear the difference between a field with and without a label. Note that the example text is vocalized correctly.
fr: Dans l'exemple ci-dessous, certains champs de formulaire sont labellisés et d'autres non. Vous pouvez donc écouter la différence de vocalisation entre un champ labellisé et un champ non labellisé. A noter qu'un texte d'exemple qui remplit le champ est bien vocalisé.

# example_form_label_textfield_placeholder
source: Name
fr: Nom

# example_form_label_textfield_accessibilityLabel
source: User name
fr: Nom d'utilisateur

# example_form_label_memory
source: Remember me
fr: Se souvenir de moi

# example_form_label_valid
source: Confirm
fr: Valider
