Repository: Orange-OpenSource/m-dan
Catalog: iOS/DAN/*.lproj/Localizable.strings
Languages: fr

# criteria_category_readingOrder_whatFor
source: The reading order allows the screen reader user to locate the navigation and ensuring functional coherence. It is therefore important to pay attention to it.
fr: L'ordre de lecture permet à l'utilisateur de se repérer dans la navigation et d'assurer une cohérence fonctionnelle. Il est donc important d'y faire attention.

# criteria_category_readingOrder_howTo
source: Ensure logic order and coherent reading to screen reader users.
fr: L'ordre de lecture doit être logique et cohérent.

# example_readingOrder_remoteControl_title
source: Reading Order
fr: Ordre de lecture

# example_readingOrder_remoteControl_shortDescription
source: Reading Order
fr: Ordre de lecture

# example_readingOrder_remoteControl_description
source: In this example, the reading order is "non accessible" and does not allow the user to correctly use the remote control. This one is incoherent and inconsistant. There is no logic order in the channel numbers.
fr: Dans l'exemple ci-dessous, l'ordre de lecture "non accessible" ne permet pas d'utiliser les boutons de la télécommande correctement. Celui-ci est incohérent et inconsistant. Il n'y a pas de logique dans l'enchaînement des numéros de chaîne.

# example_readingOrder_remoteControl_volumePlus
source: volume plus
fr: augmenter le volume

# example_readingOrder_remoteControl_volumeMinus
source: volume minus
fr: diminuer le volume

# example_readingOrder_remoteControl_channelPlus
source: channel plus
fr: passer à la chaine suivante

# example_readingOrder_remoteControl_channelMinus
source: channel minus
fr: passer à la chaine précédente

# criteria_category_language_whatFor
source: VoiceOver vocalization uses the default language of the mobile. Sometimes some words / texts of an application are in a different language. In order to make them audible, they have to be declared in that specific language.
fr: La vocalisation donnée par VoiceOver s'effectue par défaut dans la langue du système du mobile. Il arrive parfois que certain mots/textes d'une application soient dans une langue différente. Afin que la vocalisation soit audible, il faut déclarer ces textes dans la langue correspondante.

# criteria_category_language_howTo
source: Notify the change of language for text and words.
fr: Déclarer les changement de languages pour les textes et mots non courant.

# example_language_accent_title
source: Vocalization according to the language
fr: Vocalisation selon la langue

# example_language_accent_shortDescription
source: Ensure a good vocalization for the words in a different language
fr: Assurer une bonne vocalisation pour les mots dans une autre langue

# example_language_accent_description
source: The following examples show some cases where it is pertinant to vocalize in a different language from the default language.
fr: Ci-dessous, quelques exemples qu'il est nécessaire de déclarer dans une autre langue que celle du système.

# example_language_accent_newsletter
source: newsletter
fr: warning

# criteria_category_voiceOver_whatFor
source: The majority of our examples will use Apple's screen reader. It is therefore important to master the basic gestures to continue to discover the mDAN application. VoiceOver is a screen reader that describes aloud the items that appear on your phone screen. It is free and allows a blind or visually impaired, dyslexic and illiterate user to be able to vocalize all the visible elements contained in the page.
fr: VoiceOver est un lecteur d’écran intégré qui décrit à haute voix les éléments qui apparaissent sur l’écran de votre téléphone. Il est gratuit et permet à un utilisateur non ou mal voyant, dyslexique et illettré de pouvoir vocaliser tous les éléments visibles contenus dans la page.

# criteria_category_voiceOver_howTo
source: To activate it, go to settings: Settings/General/Accessibility/VoiceOver
fr: Pour activer VoiceOver, il suffit de l’activer dans le menu : Réglages/Général/Accessibilité/VoiceOver

# example_voiceOver_carousel_description
source: When VoiceOver is on, the standard gestures behave differently. Furthermore, additional gestures let you move the focus on the screen and control the selected items. VoiceOver has gestures with one, two and three fingers to select and to go through elements. We describe here the basic gestures commonly used.
fr: Nous décrirons ici les gestes de base pour une utilisation courante de VoiceOver : Lorsque VoiceOver est activé, les gestes standard effectués sur l’écran tactile donnent des résultats différents ; en outre, des gestes supplémentaires permettent de se déplacer à l’écran et de contrôler des éléments sélectionnés. VoiceOver comprend des gestes de toucher et de balayage à deux, trois et quatre doigts. Nous décrirons ici les gestes de base pour une utilisation courante de VoiceOver.

# example_voiceover_accent_title
source: See all gestures
fr: Voir tous les gestes

# example_voiceover_accent_shortDescription
source: We describe here the basic gestures commonly used.
fr: Nous décrirons ici les gestes de base pour une utilisation courante de VoiceOver.

# example_voiceover_carousel_accessibleCarousel
source: Basic Voice Over gestures
fr: Gestes de base de Voice Over

# tab_developer_title
source: Developer
fr: Développeur

# tab_developer_title_short
source: Developer
fr: Développeur

# developer_section_description
source: Description and how to use it
fr: Description et utilisation

# developer_description_cell
source: The developer guide aims to help the developers with the most important accessibility options available on the iOS SDK. Through several categories, this guide explains how to use the accessibility attributes and methods and provides different links to the Apple's official documentation.
fr: Le guide pour développeur a pour vocation d'aider les développeur avec les principales options d'accessibilité du SDK iOS. A travers différentes catégories, ce guide explique comment utiliser les attributs et méthodes d'accessibilité et propose des liens vers la documentation officielle d'Apple.

# developer_option_textualAlternative
source: Textual alternative
fr: Alternative textuelle

# developer_option_elementsSemantic
source: Elements semantic
fr: Sémantique des éléments

# developer_option_hideItems
source: Hide accessibility items
fr: Masquer des éléments à l’accessibilité

# developer_option_changeVocalization
source: Change vocalization language
fr: Modifier la langue de vocalisation

# developer_option_changeVoiceOverFocus
source: Change VoiceOver focus area
fr: Modifier la zone de focus VoiceOver

# developer_option_groupItems
source: Group items
fr: Grouper des éléments

# developer_option_accessibilityOptionsState
source: Checking accessibility options state
fr: Connaitre l’état des options d’accessibilité

# developer_option_triggerVocalization
source: Trigger a vocalization
fr: Déclencher une vocalisation

# developer_option_notifyChangeOnPage
source: Notify change on page
fr: Informer d’une modification sur la page

# developer_option_systemEvents
source: System events
fr: Evènements système

# developer_option_textSize
source: Text size
fr: Taille des textes

# developer_option_readingOrder
source: Reading order
fr: Ordre de lecture

# voiceover_text_desctription
source: VoiceOver is a built-in screen reader that reads aloud the items that appear on the device screen. It is free and vocalize all visible elements in the page specially for blind or partially sighted, dyslexic or illiterate user.
fr: VoiceOver est un lecteur d’écran intégré qui décrit à haute voix les éléments qui apparaissent sur l’écran de votre téléphone. Il est gratuit et permet à un utilisateur non ou mal voyant, dyslexique et illettré de pouvoir vocaliser tous les éléments visibles contenus dans la page.

# voiceover_text_activation
source: To activate it, go to settings:
fr: Pour activer VoiceOver, il suffit de l’activer dans le menu :

# voiceover_text_settingsPath
source: Settings/General/Accessibility/VoiceOver
fr: Réglages/Général/Accessibilité/VoiceOver

# voiceover_text_use
source: When VoiceOver is on, the standard gestures behave differently. Furthermore, additional gestures let you move the focus on the screen and control the selected items. VoiceOver has gestures with one, two and three fingers to select and to go through elements. We describe here the basic gestures commonly used.
fr: Lorsque VoiceOver est activé, les gestes standard effectués sur l’écran tactile donnent des résultats différents ; en outre, des gestes supplémentaires permettent de se déplacer à l’écran et de contrôler des éléments sélectionnés. VoiceOver comprend des gestes de toucher et de balayage à deux, trois et quatre doigts. Nous décrirons ici les gestes de base pour une utilisation courante de VoiceOver.

# voiceover_text_links
source: For more information about VoiceOver and a detailed description of its features, please read the
fr: Pour plus d’informations sur VoiceOver et une description détaillée de ses fonctionnalités, nous vous invitons à lire la

# voiceover_appleDocLink
source: Apple's official documentation on VoiceOver
fr: documentation officielle d’Apple

# voiceover_gestures
source: Show all gestures
fr: Voir tous les gestes

# voiceover_gesture_action_1
source: Drag one finger on the screen
fr: Se déplacer avec un doigt sur l’écran

# voiceover_gesture_action_2
source: Double-tap anywhere on the screen
fr: Double-cliquer n’importe où sur l’écran

# voiceover_gesture_action_3
source: Swipe up using three fingers
fr: Slider vers le haut en utilisant trois doigts

# voiceover_gesture_action_4
source: Swipe down using three fingers
fr: Slider vers le bas en utilisant trois doigts

# voiceover_gesture_action_5
source: Swipe left using three fingers
fr: Slider vers la gauche en utilisant trois doigts

# voiceover_gesture_action_6
source: Swipe right using three fingers
fr: Slider vers la droite en utilisant trois doigts

# voiceover_gesture_action_7
source: Swipe left using one finger
fr: Slider vers la gauche en utilisant un doigt

# voiceover_gesture_action_8
source: Swipe right using one finger
fr: Slider vers la droite en utilisant un doigt

# voiceover_gesture_action_9
source: Swipe up using one finger
fr: Slider vers le haut en utilisant un doigt

# voiceover_gesture_action_10
source: Swipe down using one finger
fr: Slider vers le bas en utilisant un doigt

# voiceover_gesture_result_1
source: Explore your screen and hear audible feedback for what is being touched.
fr: Explorer l’écran et entendre la vocalisation de l’élément qui est touché.

# voiceover_gesture_result_2
source: Opens or activates the item that you last touched (vocalized).
fr: Ouvre ou active l’élément qui a été touché (vocalisé) en dernier.

# voiceover_gesture_result_3
source: Scroll within lists or pages if selected. Equivalent to a vertical swipe.
fr: Se déplacer verticalement (vers le haut) sur une liste ou sur une page à condition qu’elle soit sélectionnée.

# voiceover_gesture_result_4
source: Scroll within lists or pages if selected. Equivalent to a vertical swipe.
fr: Se déplacer verticalement (vers le bas) sur une liste ou sur une page à condition qu’elle soit sélectionnée.

# voiceover_gesture_result_5
source: Change pages and screens when possible. Equivalent to a horizontal swipe.
fr: Se déplacer horizontalement (vers la gauche) quand c’est possible.

# voiceover_gesture_result_6
source: Change pages and screens when possible. Equivalent to a horizontal swipe.
fr: Se déplacer horizontalement (vers la droite) quand c’est possible.

# voiceover_gesture_result_7
source: Move the focus to the previous item.
fr: Déplacer le focus VoiceOver sur l’élément précédent.

# voiceover_gesture_result_8
source: Move the focus to the next item.
fr: Déplacer le focus VoiceOver sur le prochain élément.

# voiceover_gesture_result_9
source: Increase the selected rotor option
fr: Permet d’augmenter la valeur d’un élément ajustable.

# voiceover_gesture_result_10
source: Decrease the selected rotor option
fr: Permet de diminuer la valeur d’un élément ajustable.

# options_description_cell
source: On iOS there are several accessibility options to help disabled people. We will present you a sub part of the available options:
fr: Sous iOS il existe un certain nombre d'options d'accessibilité pour améliorer le confort des utilisateurs en situation de handicap. Nous allons ici en présenter quelques-unes.

# options_section_accessibilityOptions
source: Accessibility options
fr: Options d'accessibilité

# options_option_characterScale
source: Larger text
fr: Agrandissement des caractères

# options_option_contrastIncrease
source: Increase contrast
fr: Augmentation des contrastes

# options_option_monoMode
source: Mono audio
fr: Mode mono

# options_option_colorInversion
source: Invert colors
fr: Inversion des couleurs

# options_option_buttonForm
source: Button shapes
fr: Formes des boutons

# options_option_selectionControl
source: Focus control
fr: Contrôle de sélection

# option_characterScale_desctription
source: This option allows to increase the font size on the phone and on the applications. As explained in the developer guide, it is necessary for applications to do what it takes for this to work properly.
fr: Cette option permet d'agrandir la taille des caractères du téléphone et des applications. Comme expliqué dans le guide développeur, il est nécessaire pour les applications de faire ce qu'il faut pour que cette option fonctionne correctement.

# option_characterScale_activation
source: Settings > General > Accessibility > Larger Text
fr: Réglages > Général > Accessibilité > Police plus grande

# option_contrastIncrease_desctription
source: Improves artificially the contrast.
fr: Permet d’améliorer artificiellement le contraste.

# option_contrastIncrease_activation
source: Settings > General > Accessibility > Increase Contrast
fr: Réglages > Général > Accessibilité > Augmenter le contraste

# option_monoMode_desctription
source: Allows to convert stereo audio to mono audio, particularly for people with hearing impairments.
fr: Permet de passer d’un son stéréo à mono. Très utile pour les personnes avec une déficience auditive sur une oreille.

# option_monoMode_activation
source: Settings > General > Accessibility > Mono audio
fr: Réglages > Général > Accessibilité > Audio mono

# option_zoom_desctription
source: Allows to zoom on the screen. Once enabled, tapping twice with three fingers on the screen to perform a zoom. It is then possible the swipe on the screen using three fingers.
fr: Permet de zoomer sur l'écran. Une fois l'option activée, appuyez deux fois sur l'écran avec trois doigts pour effectuer le zoom. Il est ensuite possible de se déplacer sur l’écran en faisant glisser trois doigts.

# option_zoom_activation
source: Settings > General > Accessibility > Zoom
fr: Réglages > Général > Accessibilité > Zoom

# option_colorInversion_desctription
source: Allows to invert colors, can help to improve the contrast on application.
fr: Cette option permet d'inverser les couleurs à l'écran, ce qui peut aider à traiter les problèmes de contrastes sur certaines applications.

# option_colorInversion_activation
source: Settings > General > Accessibility > Invert Colors
fr: Réglages > Général > Accessibilité > Inverser les couleurs

# option_buttonForm_desctription
source: Allows to change the shape of a button. Since iOS 7, buttons are only colored text. When enabled, the buttons are drawn.
fr: Permet d’afficher une forme aux boutons. Depuis iOS 7, les boutons sont de simples textes de couleurs. Avec cette option activée, les boutons sont dessinés.

# option_buttonForm_activation
source: Settings > General > Accessibility > Button Shapes
fr: Réglages > Général > Accessibilité > Formes des boutons

# option_selectionControl_desctription
source: Switch Control allows to sequentially highlight items on the screen that can be activated through an adaptive accessory. It is possible via a user action, to activate the focused element, or cancel the action etc. The action can be configured by the user: we can use the camera to detect when nodding the head on the right for example. This is useful particularly for people with motor impairments.
fr: Le contrôle de sélection permet, une fois activé, d’afficher un focus à l’écran qui va se déplacer automatiquement d’élément interactif en élément interactif. Il est possible, via une action utilisateur, d’activer l’élément focus, d’annuler son action etc. L’action peut être configurée : par exemple, on peut utiliser la caméra pour que l’action soit un simple mouvement de tête vers la droite. Cet option est utile pour des personnes avec des difficultés motrices.

# option_selectionControl_activation
source: Settings > General > Accessibility > Switch Control
fr: Réglages > Général > Accessibilité > Contrôle de sélection

# plus_menu_home
source: Introduction to accessibility
fr: Introduction à l'accessibilité

# plus_menu_orangeAccessibility
source: Accessibility declaration
fr: Déclaration d'accessibilité

# plus_menu_about
source: About
fr: A propos

# intro_header1
source: Accessibility, kezako?
fr: L’accessibilité, kesako ?

# intro_header2
source: Why digital accessibility?
fr: Pourquoi l’accessibilité numérique ?

# intro_header3
source: DAN among that:
fr: Et DAN dans tout ça :

# intro_text1
source: It is the ability of a product or service to be used by all in all kinds of situations. An accessible mobile application is an application that supports the built-in accessibility options of a device. Thus, a blind user, visually impaired, hearing impaired or with any other type of disability will be able to use 100% of the functionality of the application.
fr: C'est la capacité d'un produit ou d'un service à être utilisable par tous dans tous les contextes. On dit d'une application mobile qu'elle est accessible si elle interagit correctement avec les options d'accessibilité offertes nativement par le mobile. Ainsi, un utilisateur non-voyant, malvoyant, malentendant ou présentant tout autre type de handicap sera en mesure d'utiliser 100% des fonctionnalités d'une application.

# intro_text2
source: • Because there is over 80 million disabled and elderly people in Europe • Because we spend on average 8 years of our life in a handicap situation • But also and especially because an accessible product is easier to use and everyone would benefit from it!
fr: • Parce qu’elle bénéficie à 80 millions de personnes handicapeés ou séniors en Europe • Parce que nous passons en moyenne 8 ans de notre vie en situation de handicap • Mais aussi et surtout parce qu’un produit accessible est plus facile à utiliser et qu’il bénéficie à tous !

# intro_text3
source: Digital accessibility is often unknown or unrecognized field. This Digital Accessibility Demonstrator aims to introduce mobile accessibility in all its forms. The application explains: - What is digital accessibility - Accessibility options that exist on iOS How to use the built-in options A guide for VoiceOver (iOS screenreader). - Mobile accessibility criteria (non-technical presentation) with examples. - A memo for developers (how to develop accessible).
fr: L'accessibilité numérique est un domaine souvent inconnu ou méconnu. Le présent Démonstrateur d'Accessibilité Numérique a pour vocation de présenter l'accessibilité mobile sous toutes ses formes. L'application présente donc : - Ce qu'est l'accessibilité numérique. - Les options d'accessibilité qui existent sous iOS. - Comment utiliser les options offertes par les mobiles?. - Un guide pour VoiceOver (le lecteur décran d'iOS). - Les critères d'accessibilité mobile (présentation non technique) avec des exemples. - Un mémo pour développeurs (comment développer accessible).

# orange_accessibility_nav_title
source: Declaration
fr: Déclaration

# orange_title
source: And at Orange?
fr: Et chez Orange ?

# orange_header
source: Accessible applications
fr: Applications accessibles

# orange_text
source: Orange is striving to make its mobile applications accessible. In this section we offer a list of applications that held a special interest to accessibility for their developments.
fr: Orange s'efforce de rendre ses applications mobiles accessibles. Dans cette section, nous vous proposons une liste d'applications ayant porté un intérêt particulier à l'accessibilité pendant leurs développements.

# orange_myLivebox
source: My Livebox
fr: Ma Livebox

# orange_myNetwork
source: My Network
fr: Mon Réseau

# orange_myOrange
source: My Orange
fr: Orange et moi

# about_title
source: About
fr: À propos

# about_otherLicencesHeader
source: Third-party software
fr: Logiciels tiers

# about_legalNoticeText
source: Documentation under the CC BY 3.0 license, source code of this site and examples under the http://google.com license. The Orange logo and some images or screenshots are property of Orange: Copyright &#169; 2016 Orange SA All rights reserved %@
fr: Documentation sous licence CC BY 3.0, code source de l'application ainsi que les exemples sous licence http://google.com . Le logo Orange ainsi que certaines images et captures sont la propriété d'Orange: Copyright &#169; 2016 Orange SA All rights reserved %@

# contact_webSite
source: Web site
fr: • Site web

# contact_support
source: Ask for support
fr: • Demande de support

# contact_contactTeam
source: Contact team:
fr: Contacter l'équipe :
