Repository: Orange-OpenSource/m-dan
Catalog: iOS/DAN/*.lproj/Localizable.strings
Languages: fr

# common_hour
source: hour
fr: heure

# common_whatFor
source: What for?
fr: Le pourquoi

# common_howTo
source: How to do?
fr: La règle

# common_whatIsIt
source: What is it?
fr: Qu'est-ce que c'est ?

# common_example
source: Example
fr: Exemple

# common_examples
source: Examples
fr: Les exemples

# common_accessibleExample
source: Accessible example
fr: Exemple accessible

# common_notAccessibleExample
source: Not accessible example
fr: Exemple non accessible

# common_accessibleCustomExample
source: Accessible custom example
fr: Exemple custom accessible

# common_notAccessibleCustomExample
source: Not accessible custom example
fr: Exemple custom non accessible

# common_use
source: Use
fr: Utilisation

# common_links
source: Links
fr: Liens

# common_of
source: of
fr: sur

# common_DAN
source: EAD
fr: mDAN

# common_accessibilityDemonstrator
source: E-Accessibility Demonstrator
fr: Démonstrateur d'Accessibilité Numérique mobile

# common_accessibility
source: The accessibility
fr: L'accessibilité

# common_alertVoiceOver
source: In order to understand this example, we recommend you to activate VoiceOver. Réglages > Général > Accessibilité > VoiceOver
fr: Afin de mieux comprendre l'exemple, nous vous conseillons d'activer VoiceOver. Réglages > Général > Accessibilité > VoiceOver

# home_title
source: Home
fr: Accueil

# home_content
source: Discover the accessibility through examples, explanation and accessibility tools!
fr: Découvrez l'accessibilité à travers des exemples, explications et présentation des outils d'accessibilité!

# home_criteria_button
source: iOS Accessibility Guide
fr: Guide iOS

# home_dev_button
source: Developers' Guide
fr: Guide Développeurs

# home_options_button
source: Accessibility Options
fr: Options d'accessibilité

# tab_criteria_title
source: Criteria
fr: Critères

# tab_criteria_title_short
source: Criteria
fr: Critère

# criteria_section_description
source: Description and use
fr: Description et utilisation

# criteria_section_category
source: Categories
fr: Catégories

# criteria_description_cell
source: This guide aims to present the different accessibility criteria for getting an accessible iOS application. Each criterion explains for whom it is important, when it can be implemented, why it is important and the corresponding accessibility rule. The criteria are explained through real case examples.
fr: Ce guide a pour objectif de présenter les différents critères d'accessibilité à respecter pour obtenir une application iOS accessible. Chaque critère est présenté en expliquant pourquoi il est important et la règle d'accessibilité qui en découle. Les critères sont explicités par des exemples fonctionnel.

# criteria_description_options_cell
source: Almost all example require VoiceOver, the iOS screenreader, in order to test the accessibility. A mention at the top right of the navigation bar will be present to indicate when it is necessary to activate VoiceOver (mention with the 'Information' logo)
fr: Pour la plupart des exemples, vous devez avoir au préalable activé VoiceOver, le lecteur d'écran d'iOS

# criteria_category_image
source: Images
fr: Image

# criteria_category_color
source: Colors
fr: Couleur

# criteria_category_textualAlternative
source: Alternative text
fr: Alternative textuelle

# criteria_category_titleAndHeader
source: Title and header
fr: Titre et en-tête

# criteria_category_elementState
source: Element states
fr: État des éléments

# criteria_category_standardComponents
source: Standard components
fr: Composants standards

# criteria_category_clickZone
source: Touch target
fr: Zone de clic

# criteria_category_ghostElement
source: Ghost element
fr: Élément fantôme

# criteria_category_textSize
source: Text size
fr: Taille des textes

# criteria_category_contentControl
source: Content control
fr: Contrôle du contenu

# criteria_category_contentChange
source: Changing content
fr: Changement de contenu

# criteria_category_horizontalScroll
source: Horizontal scroll
fr: Scroll horizontal

# criteria_category_orientation
source: Orientation device
fr: Orientation

# criteria_category_form
source: Form
fr: Formulaire

# criteria_category_readingOrder
source: Reading order
fr: Ordre de lecture

# criteria_category_language
source: Language
fr: Langue

# criteria_category_image_whatFor
source: The images are often used to convey a lot of information. As the saying goes, a picture is worth a thousand words.
fr: Les images sont très souvent utilisées pour transmettre de nombreuses informations. Comme le dit l'adage, une image vaut mille mots.

# criteria_category_image_howTo
source: The blind cannot see the images, it is important that they have an alternative that gives all the information carried by the image. Some images are used for decorative purposes. These pictures do not require alternative. We will see through several examples how to set text alternatives for images.
fr: Les non-voyants ne pouvant voir les images, il est important que celles-ci possèdent une alternative qui donne toutes les informations portées par l'image. A noter toutefois que certaines images sont utilisées à des fins décoratives. Ces images ne nécessitent pas d'alternative. On verra à travers plusieurs exemples comment bien renseigner les alternatives des images.

# example_image_info_title
source: Image conveying information
fr: L'image porteuse d'information

# example_image_info_shortDescription
source: Image containing text or providing information
fr: Image contenant du texte ou informative

# example_image_info_description
source: All images conveying information must have a text alternative. In the case of an image containing text, this text will be the alternative. In the case of an image that provides information as a graph, drawing or other, the alternative will contain all necessary information in the image.
fr: Toute image portant de l'information doit avoir une alternative textuelle. Dans le cas d'une image contenant du texte, l'alternative sera ledit texte. Dans le cas d'une image qui apporte des informations sous la forme d'un graphe, dessin ou autre, l'alternative devra contenir toutes les informations nécessaires présentes dans l'image.

# example_image_info_accessibilityLabel
source: Buy internet plans up to 160 euros off if you are committed to another Internet provider and if you are an Orange mobile customer
fr: Souscrivez une offre internet, jusqu’à 160 euros reboursés si vous êtes engagé chez un autre fournisseur d’accès Internet et si vous êtes client Orange mobile

# example_image_info_accessibilityHint
source: Click to discover the offer
fr: Cliquer pour découvrir l’offre

# example_image_deco_title
source: Decorative image
fr: L'image décorative

# example_image_deco_shortDescription
source: My image is purely decorative
fr: Mon image est purement décorative

# example_image_deco_description
source: A decorative image itself is an image used for illustrative purposes or to highlight text. The image is decorative only and is not intended to give any information to the user. The image do not require text alternative. There is nothing to do in this case: by default on iOS, images are not vocalized by the VoiceOver screen reader
fr: Une image dite décorative est une image utilisée pour illustrer un propos ou pour mettre en valeur un texte. Cette image est donc uniquement esthétique et n'a pas vocation à donner la moindre information à l'utilisateur. Ces images ne nécessitent pas d'alternative textuelle. Le travail à faire dans ce cas est donc nul : par défaut sous iOS, les images ne sont pas vocalisées par le lecteur d'écran VoiceOver.

# example_image_deco_accessibilityLabel
source: My Orange
fr: Orange et moi

# example_image_deco_myOrange
source: My Orange
fr: Orange et moi

# example_image_deco_myOrangeDescription
source: Service changes with Orange. My Orange is an application that allows you to manage your account.
fr: Le service change avec Orange. Orange et moi est une application qui vous permet de gérer votre compte.

# example_image_illustration_title
source: Illustrations and icons
fr: Illustrations et icones

# example_image_illustration_shortDescription
source: What alternative to illustrations and icons?
fr: Quelles alternatives donner aux icones et aux illustrations ?

# example_image_illustration_description
source: Application illustrations are also considered decorative images. The rule is the same. There is no alternative to add text The icons are, conversely, widely used as buttons. Therefore they need relevant text alternatives
fr: Les illustrations de l'application sont également considérées comme des images décoratives. La règle est donc la même : il n'y a pas d'alternative textuelle à ajouter. Les icônes sont, a contrario, largement utilisées en tant que bouton pour des fonctionnalités diverses. Elles ont donc besoin d'alternatives textuelles pertinentes.

# example_image_illustration_accessibilityLabel
source: Man on a mountain peak
fr: Montagnard partant vers un sommet

# example_image_illustration_parameter_accessibilityLabel
source: Image Settings
fr: Paramètres

# example_image_illustration_edit_accessibilityLabel
source: Edit the image name
fr: Éditer le nom de l'image

# criteria_category_color_whatFor
source: Colors have a very important role in the transmission of information. Some colors are associated with concepts or feelings but we must never forget the part of the population that does not correctly distinguish colors.
fr: Les couleurs jouent un rôle très important dans la transmission des informations. On associe certaines couleurs à des concepts ou à des sensations mais il ne faut pas oublier qu'une partie de la population ne distingue pas correctement les couleurs.

# criteria_category_color_howTo
source: The most impacted are people with visual impairments. Some rules has to be followed: 1. Do not use color as the only way of conveying information, indicating an action, requesting a response or distinguishing an element. 2. The contrast between the color of the background and the text must be at least 7:1 and 4.5:1 for large font (can be measured with the color contrast analyzer tool).
fr: Les malvoyants sont particulièrement impactés par l'usage des couleurs. Il est donc nécessaire de respecter quelques règles essentielles : 1. La couleur ne doit jamais être le seul canal de transmission d'une information. 2. Le contraste entre les couleurs de texte et de fond doit aussi être suffisant (7:1 sur mobile, 4,5:1 pour les textes larges, à calculer avec Color Constrast Analyzer par exemple). Illustrons ces règles à travers des exemples.

# example_color_contrast_title
source: Contrast
fr: Contrastes

# example_color_contrast_shortDescription
source: What is the correct contrast?
fr: Quels sont les contrastes à respecter ?

# example_color_contrast_description
source: In an unfavorable environment (e.g. outdoors), all users can be uncomfortable with the screen contrast. Though, it is mandatory to pay attention to the contrast between the text color and the background. The WCAG2 define 2 contrast levels to get a AA or AAA level. On mobile, we always try to reach the AAA level, which is 7:1. To measure this contrast, one can use a lot of tools, Color Contrast Analyzer is one of them.
fr: Dans un contexte lumineux défavorable (à contre-jour par exemple), tout utilisateur est gêné par le manque de contraste d'une interface. Il est donc nécessaire de faire attention au contraste entre la couleur d'un texte et la couleur de fond. Les WCAG2 définissent 2 niveaux de contraste à partir duquel on obtient un niveau AA ou AAA. Sur mobile, on essaie toujours d'atteindre le niveau AAA, soit 7:1. Afin de mesurer ce niveau de contraste, de nombreux outils existent, par exemple Color Contrast Analyzer.

# example_color_contrast_cellTitleAccessible
source: Title with good contrast
fr: Le titre est suffisamment contrasté

# example_color_contrast_cellTitleNonAccessible
source: Title with poor contrast
fr: Le titre est insuffisamment contrasté

# example_color_contrast_cellSubtitleAccessible
source: Subtitle with good contrast
fr: Sous-titre suffisamment contrasté

# example_color_contrast_cellSubtitleNonAccessible
source: Subtitle with poor contrasted
fr: Sous-titre insuffisamment contrasté

# example_color_info_title
source: Information through colors
fr: Information par la couleur

# example_color_info_shortDescription
source: Color must not be the only information channel
fr: La couleur ne doit pas être le seul canal d'information

# example_color_info_description
source: Color must not be the only information channel. The shape or the position can be an alternative way to convey information. There are several disease related to visual impairments. For example, colorblinds represent 8% of the male population, 0.5% for the female population. In the following example a colorblind cannot distinguish any of the service status.
fr: La couleur ne doit jamais être le seul canal de transmission d'une information. La forme ou la position peuvent être un second moyen pour véhiculer de l'information. Il existe de nombreux problèmes de vision liés à la perception des couleurs. Pour ne citer que le daltonisme, celui-ci représente 8% de la population masculine et 0.5% de la population féminine. Imaginez donc si un feu tricolore n'avait qu'une seule ampoule et que vous soyez incapable de distinguer le rouge et le vert ! Dans l'exemple non accessible ci-dessous, un daltonien ne peut pas connaître l'état de ses services.

# example_color_info_serviceVideo
source: Video streaming
fr: Streaming vidéo

# example_color_info_serviceAudio
source: Audio streaming
fr: Streaming audio

# example_color_info_serviceBrowser
source: Web browser
fr: Navigateur web

# example_color_info_statusLegendTitle
source: Legend
fr: Légende

# example_color_info_statusLegendOn
source: Active
fr: Actif

# example_color_info_statusLegendError
source: Error
fr: Erreur

# example_color_info_statusLegendOff
source: Inactive
fr: Inactif

# example_color_info_AL_active
source: active
fr: actif

# example_color_info_AL_error
source: in error
fr: en erreur

# example_color_info_AL_inactive
source: inactive
fr: inactif

# criteria_category_textualAlternative_whatFor
source: Text alternatives are at the core of mobile accessibility. Thanks to them, a visually impaired user can use an application without loss of information.
fr: Les alternatives textuelles sont au coeur de l'accessibilité sur mobile. Grâce à elles, un utilisateur non voyant peut utiliser une application sans perte d'information.

# criteria_category_textualAlternative_howTo
source: As for the images, it is important to add a text alternative when information is not available for the visually impaired/blind. This is the case of components that provide information by color, shape, position, sound etc On mobile, all components can have a text alternative, it is possible to enrich the native vocalization of an element, including a simple text.
fr: Tout comme pour les images, il est important de renseigner une alternative textuelle lorsque l'information n'est pas disponible pour les personnes malvoyantes/non-voyantes. C'est le cas des composants fournissant de l'information par la couleur, la forme, la position, le son etc Sur mobile, tous les composants peuvent recevoir une alternative textuelle, il est donc possible d'enrichir la vocalisation native d'un élément, y compris celle d'un simple texte.

# example_textualAlternative_image_title
source: Text alternative of images
fr: Les alternatives textuelles des images

# example_textualAlternative_elementState_title
source: Element states
fr: L’état des éléments

# example_textualAlternative_form_title
source: Forms
fr: Les formulaires

# example_textualAlternative_date_title
source: Abbreviation, date and hours
fr: Abréviation, date et heures

# example_textualAlternative_date_shortDescription
source: Textual alternative of text
fr: Alternative textuelle de texte

# example_textualAlternative_date_description
source: Space on mobile is reduced, we often use abbreviations for text. But However, this raises an issue for voice synthesis users that vocalize abbreviations as is. To correct these vocalizations, simply place a text alternative on the text. This alternative contains the unshorten text. Note that VoiceOver can recognize some common abbreviations. For example, "etc." is vocalized "etcetera"
fr: La place sur mobile étant réduite, on utilise bien souvent des abréviations pour les textes. Cependant, cela pose un problème aux utilisateurs de synthèse vocale qui restitue les abréviations telles quelles. Pour corriger ces vocalisations, il suffit de placer une alternative textuelle sur le texte. Cette alternative contient le texte non abrégé. La technique est la même pour les dates : positionner dans l'alternative textuelle du composant la date en toute lettre. A noter que VoiceOver sait reconnaitre quelques abréviations courantes. Par exemple, "etc." est bien vocalisé "etcetera".

# example_textualAlternative_date_accessibilityLabel
source: Examples of e-accessibility demonstrator
fr: Exemples du Démonstrateur d’Accessibilité Numérique

# example_textualAlternative_date_app_accessibilityLabel
source: Mobile App, web etc.
fr: Application mobile, web etc.

# example_textualAlternative_date_rdv
source: Rdv with Dr. François
fr: Rdv avec le Dr. François

# example_textualAlternative_date_rdv_accessibilityLabel
source: Rendez-vous with Doctor François
fr: Rendez-vous avec le docteur François

# example_textualAlternative_textImage_title
source: Text and image combined
fr: Duo texte-image

# example_textualAlternative_textImage_shortDescription
source: For short text that complement a picture
fr: Pour les bouts de texte qui complète une image

# example_textualAlternative_textImage_description
source: Some images are regularly associated with text to give information. This is the case of "unread messages" when a badge shows the number of messages to read and which describes a "message". In this case, the solution is to set a text alternative on the text that gives all the necessary information. For example: "3 unread messages". One can also set this alternative on the images but in this case we must make the text "invisible" to the screen reader.
fr: Certaines images sont régulièrement associées à du texte pour donner une information. C'est le cas notamment des "messages non lus" où une infobulle donne le nombre de messages à lire et où une image donne l'information "message". Dans ce cas, la solution consiste à placer une alternative textuelle sur le texte qui donne toutes les informations nécessaires. Par exemple : "3 messages non lus". On peut également placer cette alternative sur l'image mais dans ce cas, il faut penser à rendre le texte "invisible" pour le lecteur d'écran.

# example_textualAlternative_textImage_accessibilityLabel
source: unread mails
fr: mails non lus

# criteria_category_titleAndHeader_whatFor
source: The page title is the first element vocalized or seen on a screen mobile. It makes the navigation easier for everyone: at any time, we know where we are in the application. Header are specific to iOS. They allow to set the "title" semantic to an element. This information is useful to VoiceOver because it can navigate through the headers (VoiceOver wheel, header mode)
fr: Le titre de la page est le premier élément qui est vocalisé ou vu sur un écran mobile. Il facilite la navigation pour tout le monde : à tout moment, on sait où on se trouve dans l'application. Les entêtes sont propres à iOS. Elles permettent de donner la valeur sémantique "titre" à un élément. Les entêtes sont très pratique car VoiceOver intègre un mode de navigation d'entête en entête.

# criteria_category_titleAndHeader_howTo
source: Each screen must have its own title allowing use know where we are in the application navigation
fr: Chaque écran doit avoir un titre qui lui est propre ou qui permet de se repérer dans la navigation.

# example_titleAndHeader_title_title
source: Page title
fr: Titre de page

# example_titleAndHeader_title_shortDescription
source: Each view has its own title
fr: Chaque vue à son propre titre

# example_titleAndHeader_title_description
source: A common mistake is to set a unique title for every page of an application (or even no title at all). Therefore, it is necessary to set a relevant title to each page
fr: Une erreur commune est de mettre un titre unique pour toutes les pages d'une application (ou même pas de titre du tout). Il est très important de choisir un titre qui donne les bonnes informations concernant la page sur laquelle on se trouve.

# example_titleAndHeader_title_segmentTitle
source: Accessible title
fr: Titre accessible

# example_titleAndHeader_headerBis_title
source: Headers
fr: En-têtes

# example_titleAndHeader_headerBis_shortDescription
source: Headers on text
fr: En-têtes sur des textes

# example_titleAndHeader_headerBis_description
source: iOS headers allow structuring pages providing additional information. This information is useful to the accessibility API because VoiceOver can navigate through the headers (VoiceOver wheel, header mode). This allows the user to browse the page faster.
fr: Les en-tête iOS permettent des structurer les pages en apportant une information supplémentaire. Cette information est utile à l'API d'accessibilité car VoiceOver est capable de naviguer d'en-tête en en-tête (molette de VoiceOver, mode en-tête). Cela permet de se déplacer plus rapidement dans la page.

# example_titleAndHeader_headerBis_headerLabelText
source: Delivery address
fr: Adresse de livraison

# example_titleAndHeader_headerBis_headerLabelText2
source: Billing address
fr: Adresse de facturation

# example_titleAndHeader_header_title
source: Headers - 2
fr: En-têtes - 2

# example_titleAndHeader_header_shortDescription
source: List headers
fr: En-têtes de listes

# example_titleAndHeader_header_description
source: It is also possible to set the headers on fold areas like in the following example.
fr: Il est également possible de positionner des en-tête sur les listes à section comme le montre l'exemple ci-dessous.

# example_elementState_foldArea_open_accessibilityHint
source: Click here to unfold
fr: Cliquer pour ouvrir la section

# example_elementState_foldArea_close_accessibilityHint
source: Click here to close
fr: Cliquer pour fermer la section

# example_elementState_foldArea_firstnameList
source: List names
fr: Liste de prénoms

# criteria_category_standardComponents_whatFor
source: Accessibility is (mostly) handled in the native components. Additionally, the use of standard components allows the user to be in a situation or behavior that he is already used to. Navigation through a standard interface is more comfortable.
fr: L'accessibilité est prise en compte dans les composants natifs. De plus, l'utilisation de composants standards permet à l'utilisateur de se retrouver dans une situation et un comportement habituels. La navigation dans une interface standard est donc plus confortable.

# criteria_category_standardComponents_howTo
source: Use native components as much as possible by changing their appearance. If no standard component corresponds to the need, create a dedicated component based on a standard component while keeping the consistency / accessibility consistency.
fr: Utiliser au maximum les composants natifs en modifiant leur apparence. Si aucun composant standard ne permet de répondre au besoin, créer un composant dédié basé sur un composant standard en veillant à conserver la cohérence de navigation et l'accessibilité.

# example_standardComponents_standardVsCustom_title
source: Standard components
fr: Composants standards
